app/views/vehicules/index.html.erb

  </div>
  <%= simple_form_for @vehicule, url: vehicule_vehicule_items_path(Vehicule.first), method: "get" do |f| %>
---
SELECT  "vehicules".* FROM "vehicules" ORDER BY "vehicules"."id" ASC LIMIT $1  [["LIMIT", 1]]