app/controllers/pages_controller.rb

SELECT  "vehicle_items".* FROM "vehicle_items" ORDER BY "vehicle_items"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def home
    @vitem = VehicleItem.last