app/controllers/vehicles_controller.rb

  def find
    redirect_to vehicle_path(Vehicle.find_by_code(params["vehicle"][:code]))
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."code" = $1 LIMIT $2  [["code", "BZ-421-DE"], ["LIMIT", 1]]

  def find_vehicle
    Vehicle.find(params["id"])
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]