app/controllers/vehicule_items_controller.rb

SELECT  "vehicules".* FROM "vehicules" WHERE "vehicules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_vehicule
    Vehicule.find(params["vehicule_id"])