app/controllers/vehicle_items_controller.rb

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_vehicle
    Vehicle.find(params["id"])