app/controllers/vehicules_controller.rb

SELECT  "vehicules".* FROM "vehicules" ORDER BY "vehicules"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @vehicule = Vehicule.new
    @vehicules = Vehicule.all

SELECT  "vehicules".* FROM "vehicules" WHERE "vehicules"."name" = $1 LIMIT $2  [["name", "1235"], ["LIMIT", 1]]
---
  def find
    redirect_to vehicule_path(Vehicule.find_by_name(params["vehicule"][:name]))

SELECT  "vehicules".* FROM "vehicules" WHERE "vehicules"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_vehicle
    Vehicule.find(params["id"])